АлогистикТест2/src/Documents/алк_ЗаказНаПроизводство/алк_ЗаказНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗаказНаПроизводство</name>
  <basedOn>Document.алк_ЗаказПокупателя</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПоЗаказуПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аддендумы</name>
    <attributes>
      <name>Аддендум</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПроизводство</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Аддендумы</name>
  <comment>Уточнение договора на поставку товаров клиенту</comment>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыАддендума</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАддендума</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАддендума</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияЗапрещены</name>
    <comment>Устанавливают после регистрации в ЛесЕГАИС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВручную</name>
      <comment>Если Да - пользователь вводит руками, если нет - перезаполняется по нашим алгоритмам</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТоваров</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаОт</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаДо</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПрипуска</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗаказНаПроизводство/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура АддендумыПредставлениеТовараНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ПараметрыФормы.Вставить("Аддендум"			, Элементы.Аддендумы.ТекущиеДанные.Аддендум);
		
	ОткрытьФорму("Документ.алк_ЗаказНаПроизводство.Форма.ФормаВыбораСтроки", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 	
	
	Если ИсточникВыбора.ИмяФормы = "Документ.алк_ЗаказНаПроизводство.Форма.ФормаВыбораСтроки"  Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда  			
			ЗаполнитьЗначенияСвойств(Элементы.Аддендумы.ТекущиеДанные, ВыбранноеЗначение);				
		КонецЕсли;  	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбщийОбъемАддендума(Аддендум) 
	
	Количество = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АддендумыТовары.Ссылка КАК Ссылка,
		|	СУММА(алк_АддендумыТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|ГДЕ
		|	алк_АддендумыТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Аддендум);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  		
		Количество = ВыборкаДетальныеЗаписи.Количество; 	
	КонецЦикла;
	
	Возврат Количество;	

КонецФункции

&НаКлиенте
Процедура АддендумыАддендумПриИзменении(Элемент)	
	
	ТекущиеДанные = Элементы.Аддендумы.ТекущиеДанные;
	
	ТекущиеДанные.ОбщийОбъем = ПолучитьОбщийОбъемАддендума(ТекущиеДанные.Аддендум);
	ТекущиеДанные.ИдентификаторТовара = "";
	ТекущиеДанные.ПредставлениеТовара = "";
	ТекущиеДанные.КоличествоВПроизводство = 0;	
	
КонецПроцедуры
